In [1]:
import pandas as pd

In [3]:
titanic = pd.read_csv("/Users/akankshabakshi/Desktop/titanic3.csv")

In [4]:
titanic.head(1)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"

In [9]:
#Return 0th row
titanic.loc[0]
titanic["name"].loc[0]

'Allen, Miss. Elisabeth Walton'

In [23]:
marital_status = []
for i in range(len(titanic)):
    try:
        if "Miss" in titanic.loc[i,"name"]:
            marital_status.append("Unmarried")
        elif "Master" in titanic.loc[i,"name"]:
            marital_status.append("Unmarried")
        else:
            marital_status.append("Married")
    except:
            marital_status.append("Unknown")

In [30]:
type(marital_status)

list

In [31]:
#Add new column to a df
titanic["marital_status"] = marital_status

In [33]:
titanic.head(5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,marital_status
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",Unmarried
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",Unmarried
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",Unmarried
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",Married
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",Married